-- MySQL dump 10.13  Distrib 5.1.41, for debian-linux-gnu (i486)
--
-- Host: localhost    Database: etalon
-- ------------------------------------------------------
-- Server version	5.1.41-3ubuntu12.10

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `ActualQuestion`
--

DROP TABLE IF EXISTS `ActualQuestion`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ActualQuestion` (
  `ActualQuestionId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Question` varchar(250) NOT NULL,
  `isReverted` bit(1) DEFAULT NULL,
  PRIMARY KEY (`ActualQuestionId`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ActualQuestion`
--

LOCK TABLES `ActualQuestion` WRITE;
/*!40000 ALTER TABLE `ActualQuestion` DISABLE KEYS */;
INSERT INTO `ActualQuestion` VALUES (1,'Я не соромлюся  жодної зі своїх емоцій','\0'),(2,'Я відчуваю, що мушу робити те, що очікують від мене інші',''),(3,'Я вірю, що люди самі по собі є добрими, тому їм можна довіряти','\0'),(4,'Я можу гніватися на тих, кого люблю','\0'),(5,'Завжди необхідно, щоб інші схвалювати те, що я роблю',''),(6,'Я не приймаю своїх слабких сторін',''),(7,'Мені можуть подобатися люди, вчинки яких я не схвалюю','\0'),(8,'Я боюся невдач',''),(9,'Я намагаюся не аналізувати і не спрощувати складні сторони життя',''),(10,'Краще бути самим собою, ніж популярним','\0'),(11,'В моєму житті нема чогось такого, чому я особливо хочу присвятити себе',''),(12,'Я можу виразити свої почуття, навіть якщо це призведе до небажаних наслідків','\0'),(13,'Я не зобов’язана/зобов’язаний допомагати іншим',''),(14,'Я стомилася/стомився  від страхів і неадекватності',''),(15,'Мене люблять, тому що люблю я','\0'),(16,'Я не соромлюся  жодної зі своїх емоцій','\0'),(17,'Я відчуваю, що мушу робити те, що очікують від мене інші',''),(18,'Я вірю, що люди самі по собі є добрими, тому їм можна довіряти','\0'),(19,'Я можу гніватися на тих, кого люблю','\0'),(20,'Завжди необхідно, щоб інші схвалювати те, що я роблю',''),(21,'Я не приймаю своїх слабких сторін',''),(22,'Мені можуть подобатися люди, вчинки яких я не схвалюю','\0'),(23,'Я боюся невдач',''),(24,'Я намагаюся не аналізувати і не спрощувати складні сторони життя',''),(25,'Краще бути самим собою, ніж популярним','\0'),(26,'В моєму житті нема чогось такого, чому я особливо хочу присвятити себе',''),(27,'Я можу виразити свої почуття, навіть якщо це призведе до небажаних наслідків','\0'),(28,'Я не зобов’язана/зобов’язаний допомагати іншим',''),(29,'Я стомилася/стомився  від страхів і неадекватності',''),(30,'Мене люблять, тому що люблю я','\0');
/*!40000 ALTER TABLE `ActualQuestion` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `HollandQuestion`
--

DROP TABLE IF EXISTS `HollandQuestion`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `HollandQuestion` (
  `HollandQuestionId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Question` varchar(250) NOT NULL,
  `HollandType` varchar(30) NOT NULL,
  `HollandVector` varchar(30) NOT NULL,
  PRIMARY KEY (`HollandQuestionId`)
) ENGINE=InnoDB AUTO_INCREMENT=213 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `HollandQuestion`
--

LOCK TABLES `HollandQuestion` WRITE;
/*!40000 ALTER TABLE `HollandQuestion` DISABLE KEYS */;
INSERT INTO `HollandQuestion` VALUES (1,'Курси навчання робіт  з деревом','Realistic','ILikeIt'),(2,'Робота на легковому  автомобілі','Realistic','ILikeIt'),(3,'Ремонт господарських  споруд	','Realistic','ILikeIt'),(4,'Ремонт електроприладів	','Realistic','ILikeIt'),(5,'Налаштування музичних стереосистем	','Realistic','ILikeIt'),(6,'Домашня майстерність	','Realistic','ILikeIt'),(7,'Роботи на дачній ділянці	','Realistic','ILikeIt'),(8,'Курси навчання на автомеханіка	','Realistic','ILikeIt'),(9,'Ремонт квартири	','Realistic','ILikeIt'),(10,'Вирішення технічних  проблем	','Realistic','ILikeIt'),(11,'Відновлення старих речей, приладів... 	','Realistic','ILikeIt'),(12,'Гра на музичному  інструменті	','Artistic','ILikeIt'),(13,'Писати для газети або журналу	','Artistic','ILikeIt'),(14,'	Втілення в драматичних  творах розповіді або художнього задуму	','Artistic','ILikeIt'),(15,'	Гра в ансамблі, групі, оркестрі...	','Artistic','ILikeIt'),(16,'	Конструювати меблі, одяг...	','Artistic','ILikeIt'),(17,'	Писати портрети або займатися фотографією	','Artistic','ILikeIt'),(18,'	Пройти курси дизайну	','Artistic','ILikeIt'),(19,'	Видавництво журналу  або газети	','Artistic','ILikeIt'),(20,'	Займатися малюнком або живописом	','Artistic','ILikeIt'),(21,'	Читати або писати поетичні твори	','Artistic','ILikeIt'),(22,'	Створювати декоративні вироби 	','Artistic','ILikeIt'),(23,'	Робота в науково-дослідній  лабораторії	','Investication','ILikeIt'),(24,'	Застосовувати математику для вирішення практичної проблеми	','Investication','ILikeIt'),(25,'	Вивчати наукові  теорії	','Investication','ILikeIt'),(26,'	Аналізувати інформацію для розробки нових пропозицій, робіт	','Investication','ILikeIt'),(27,'	Читати наукові  книги і журнали	','Investication','ILikeIt'),(28,'	Знаходити вирішення  складних проблем	','Investication','ILikeIt'),(29,'	Відвідувати наукові  музеї, семінари	','Investication','ILikeIt'),(30,'	Систематизувати дані по різних проблемах, питаннях	','Investication','ILikeIt'),(31,'	Вивчати курс математичної статистики	','Investication','ILikeIt'),(32,'	Розмірковувати над науковими проблемами	','Investication','ILikeIt'),(33,'	Освоювати нову наукову  дисципліну 	','Investication','ILikeIt'),(34,'	 Працювати у  сфері соціальної підтримки і  захисту	','Social','ILikeIt'),(35,'	 Вивчати психології людських відносин	','Social','ILikeIt'),(36,'	 Вивчати факти  порушення закону неповнолітніми	','Social','ILikeIt'),(37,'	 Дискутувати в питаннях стосунків між людьми	','Social','ILikeIt'),(38,'	 Навчати інших виконувати яку-небудь роботу	','Social','ILikeIt'),(39,'	 Читати книги по соціології, статті про закономірності людського спілкування	','Social','ILikeIt'),(40,'	 Допомагати людям, з фізичними вадами	','Social','ILikeIt'),(41,'	 Допомагати людям  порадами у важких для них  ситуаціях	','Social','ILikeIt'),(42,'	Викладати в навчальних закладах	','Social','ILikeIt'),(43,'	 Піклуватися про  дітей або допомагати людям	','Social','ILikeIt'),(44,'	 Вчитися на курсах гідів або екскурсоводів 	','Social','ILikeIt'),(45,'	 Бути керівником  проекту або якого-небудь заходу	','Comerce','ILikeIt'),(46,'	 Навчатися на курсах або семінарі для керівників	','Comerce','ILikeIt'),(47,'	 Читати про  керівництво в бізнесі або  уряді	','Comerce','ILikeIt'),(48,'	 Брати участь  в політичних кампаніях	','Comerce','ILikeIt'),(49,'	 Організовувати власну справу і керувати нею	','Comerce','ILikeIt'),(50,'	 Приймати рішення  у важливих і відповідальних  справах	','Comerce','ILikeIt'),(51,'	 Впливати на інших людей	','Comerce','ILikeIt'),(52,'	 Брати участь в аукціонах, торгах	','Comerce','ILikeIt'),(53,'	 Стежити за  попитом і пропозицією на ринках	','Comerce','ILikeIt'),(54,'	 Організовувати  і проводити виборчі кампанії 	','Comerce','ILikeIt'),(55,'	 Тримати свій робочий стіл і приміщення у повному порядку	','Comerce','ILikeIt'),(56,'	 Працювати з розрахунково-обчислювальними машинами	','Conventional','ILikeIt'),(57,'	 Проводити інвентаризацію матеріальних ресурсів	','Conventional','ILikeIt'),(58,'	 Записувати свої  витрати	','Conventional','ILikeIt'),(59,'	 Проводити перевірку  документації або продукції для  виявлення помилок або пропаж	','Conventional','ILikeIt'),(60,'	 Проводити математичні розрахунки в бухгалтерії або бізнесі	','Conventional','ILikeIt'),(61,'	 Вести ділове  листування	','Conventional','ILikeIt'),(62,'	 Заповнювати стандартні форми (бланки, анкети, таблиці цифрові...)	','Conventional','ILikeIt'),(63,'	 Вчитися на бухгалтерських курсах 	','Conventional','ILikeIt'),(64,'Простий ремонт  телевізора або радіоприймача','Realistic','ICanDoIt'),(65,'Ремонт меблів','Realistic','ICanDoIt'),(66,'Використовувати  електромеханічні інструменти','Realistic','ICanDoIt'),(67,'Прочитати креслення,  схеми','Realistic','ICanDoIt'),(68,'Зробити простий електричний ремонт','Realistic','ICanDoIt'),(69,'Замінити мастило або дрібну деталь в автомобілі','Realistic','ICanDoIt'),(70,'Виконати креслення','Realistic','ICanDoIt'),(71,'Користуватися  столярними інструментами','Realistic','ICanDoIt'),(72,'Проводити слюсарний (по металу) ремонт','Realistic','ICanDoIt'),(73,'Розрахувати кількість  необхідного матеріалу для ремонту,  будівництва...','Realistic','ICanDoIt'),(74,'Використовувати  прилади електровимірювання','Realistic','ICanDoIt'),(75,'Написати розповідь,  статтю...','Artistic','ICanDoIt'),(76,'Створити рекламний  плакат','Artistic','ICanDoIt'),(77,'Писати фарбами,  ліпити...','Artistic','ICanDoIt'),(78,'Змалювати або  описати людину так, що його можна відразу ж упізнати...','Artistic','ICanDoIt'),(79,'Поставити виставу, зняти фільм...','Artistic','ICanDoIt'),(80,'Написати рекламне  оголошення','Artistic','ICanDoIt'),(81,'Розробити дизайн  для упаковок продуктів','Artistic','ICanDoIt'),(82,'Декорувати робочу установу або приміщення для відпочинку','Artistic','ICanDoIt'),(83,'Грати в спектаклі,  п\'єсі, фільмі...','Artistic','ICanDoIt'),(84,'Виготовити прості прикраси','Artistic','ICanDoIt'),(85,'Виконати художні  фотознімки','Artistic','ICanDoIt'),(86,'Використовувати комп\'ютер при вирішенні якоїсь проблеми','Investication','ICanDoIt'),(87,'Розібратися у фізичних властивостях багатьох речовин, матеріалів','Investication','ICanDoIt'),(88,'Зрозуміти і розшифрувати прості хімічні формули','Investication','ICanDoIt'),(89,'Використовувати калькулятор  і ін. обчислювальну техніку','Investication','ICanDoIt'),(90,'Застосовувати мікроскоп  для вирішення якихось наукових завдань','Investication','ICanDoIt'),(91,'Описувати роботу основних органів людського організму','Investication','ICanDoIt'),(92,'Застосовувати для  розрахунків різні цифрові таблиці','Investication','ICanDoIt'),(93,'Написати реферат  на задану тему...','Investication','ICanDoIt'),(94,'Назвати три страви з високим вмістом білка (жирів, вуглеводів...)','Investication','ICanDoIt'),(95,'Коротко, чітко, зрозуміло  викласти яку-небудь теорію або відповісти на поставлене питання  ','Investication','ICanDoIt'),(96,'Добре приймати  гостей','Investication','ICanDoIt'),(97,'Легко допомагати  іншим в прийнятті рішень','Social','ICanDoIt'),(98,'Брати участь  в благодійних акціях','Social','ICanDoIt'),(99,'Легко пояснювати  якісь речі іншим','Social','ICanDoIt'),(100,'Очолити групову  дискусію','Social','ICanDoIt'),(101,'Легко створити  людям гарний настрій','Social','ICanDoIt'),(102,'Легко розмовляти  з будь-якими людьми','Social','ICanDoIt'),(103,'Легко допомагати  людям планувати їх майбутнє','Social','ICanDoIt'),(104,'Тренувати інших','Social','ICanDoIt'),(105,'Легко вчити інших','Social','ICanDoIt'),(106,'Дуже добре  знатися на людях, їх вчинках,  настрої','Social','ICanDoIt'),(107,'Організувати роботу інших','Social','ICanDoIt'),(108,'Оцінити власні  переваги','Comerce','ICanDoIt'),(109,'Зацікавити інших','Comerce','ICanDoIt'),(110,'Організувати  і управляти компанією по продажах','Comerce','ICanDoIt'),(111,'Здібності продавати  і рекламувати','Comerce','ICanDoIt'),(112,'Планувати стратегію  (заходи) для досягнення мети','Comerce','ICanDoIt'),(113,'Здібності публічно  виступати','Comerce','ICanDoIt'),(114,'Знання, як стати  лідером, що добивається успіхів','Comerce','ICanDoIt'),(115,'Грамотно і  аргументовано відстоювати свою  точку зору','Comerce','ICanDoIt'),(116,'Почати свою  власну справу','Comerce','ICanDoIt'),(117,'Розвинути в  собі бажані якості','Comerce','ICanDoIt'),(118,'Працювати з  документами і кореспонденцією','Comerce','ICanDoIt'),(119,'Легко отримати  необхідну інформацію по телефону','Conventional','ICanDoIt'),(120,'Вести облік  доходів і витрат','Conventional','ICanDoIt'),(121,'Використовувати комп\'ютер для аналізу даних бізнесу','Conventional','ICanDoIt'),(122,'Друкувати на  пристрої, що пише','Conventional','ICanDoIt'),(123,'Складати ділові  листи і інші документи','Conventional','ICanDoIt'),(124,'Використовувати  редактори текстів на комп\'ютері','Conventional','ICanDoIt'),(125,'Створювати обстановку  для ділових зустрічей','Conventional','ICanDoIt'),(126,'Працювати на  копіювальних, розмножувальних машинах','Conventional','ICanDoIt'),(127,'Швидко помічати  помилки в розрахунках або тексті','Conventional','ICanDoIt'),(128,'Успішно користуватися  каталогами, довідниками','Conventional','ICanDoIt'),(129,'Тесляр','Realistic','Proffetion'),(130,'Фермер','Realistic','Proffetion'),(131,'Автомеханік','Realistic','Proffetion'),(132,'Фахівець з  електронної апаратури','Realistic','Proffetion'),(133,'Лісник','Realistic','Proffetion'),(134,'Шофер','Realistic','Proffetion'),(135,'Зварювальник','Realistic','Proffetion'),(136,'Радіоінженер','Realistic','Proffetion'),(137,'Інженер-механік','Realistic','Proffetion'),(138,'Гравер','Realistic','Proffetion'),(139,'Економіст','Realistic','Proffetion'),(140,'Інженер-конструктор','Artistic','Proffetion'),(141,'Ювелір','Artistic','Proffetion'),(142,'Оператор енергетичних установок','Artistic','Proffetion'),(143,'Письменник','Artistic','Proffetion'),(144,'Фотограф','Artistic','Proffetion'),(145,'Музикант','Artistic','Proffetion'),(146,'Художник','Artistic','Proffetion'),(147,'Автор художніх творів','Artistic','Proffetion'),(148,'Артист','Artistic','Proffetion'),(149,'Співець','Artistic','Proffetion'),(150,'Фахівець з  різних творів мистецтва','Artistic','Proffetion'),(151,'Журналіст','Artistic','Proffetion'),(152,'Художник-копіст','Artistic','Proffetion'),(153,'Видавець газети журналу','Artistic','Proffetion'),(154,'Акто','Investication','Proffetion'),(155,'Архітектор','Investication','Proffetion'),(156,'Дизайнер','Investication','Proffetion'),(157,'Інженер-конструктор','Investication','Proffetion'),(158,'Технік медичної лабораторії','Investication','Proffetion'),(159,'Фізик','Investication','Proffetion'),(160,'Хімік','Investication','Proffetion'),(161,'Видавець наукового  журналу','Investication','Proffetion'),(162,'Ботанік','Investication','Proffetion'),(163,'Хірург','Investication','Proffetion'),(164,'Антрополог','Investication','Proffetion'),(165,'Родинний лікар','Investication','Proffetion'),(166,'Метеоролог','Investication','Proffetion'),(167,'Науковець в області  соціальних наук (вивчає закономірності життя суспільства і людини) ','Investication','Proffetion'),(168,'Біолог','Social','Proffetion'),(169,'Науковець дослідницької лабораторії','Social','Proffetion'),(170,'Автор науково-популярних книг і статей','Social','Proffetion'),(171,'Викладач інституту, коледжу...','Social','Proffetion'),(172,'Працівник в  соціальної області','Social','Proffetion'),(173,'Логопед','Social','Proffetion'),(174,'Вчитель школи','Social','Proffetion'),(175,'Психолог','Social','Proffetion'),(176,'Фахівець з  родинного консультування','Social','Proffetion'),(177,'Викладач суспільних і соціальних наук','Social','Proffetion'),(178,'Співробітник  служби соціальної підтримки','Social','Proffetion'),(179,'Інструктор молодіжного табору','Social','Proffetion'),(180,'Консультант по  вибору професії','Social','Proffetion'),(181,'Соціолог','Social','Proffetion'),(182,'Інспектор у  справах неповнолітніх','Comerce','Proffetion'),(183,'Співробітник  служби \"Телефон довіри\"','Comerce','Proffetion'),(184,'Священник','Comerce','Proffetion'),(185,'Керівник фірмою','Comerce','Proffetion'),(186,'Керівник готелем','Comerce','Proffetion'),(187,'Директор радіо і телебачення','Comerce','Proffetion'),(188,'Агент з продажу  нерухомості','Comerce','Proffetion'),(189,'Керівник розпродажів','Comerce','Proffetion'),(190,'Завідувач відділом  маркетингу','Comerce','Proffetion'),(191,'Керівник магазином','Comerce','Proffetion'),(192,'Адвокат','Comerce','Proffetion'),(193,'Директор рекламного агентства','Comerce','Proffetion'),(194,'Посередник в торгівельних операціях','Comerce','Proffetion'),(195,'Продавець (торгівельний  працівник)','Comerce','Proffetion'),(196,'Суддя','Conventional','Proffetion'),(197,'Брокер на біржі','Conventional','Proffetion'),(198,'Керівник спортивної команди','Conventional','Proffetion'),(199,'Економіст','Conventional','Proffetion'),(200,'Рахівник','Conventional','Proffetion'),(201,'Секретар','Conventional','Proffetion'),(202,'Касир','Conventional','Proffetion'),(203,'Інспектор в  банці','Conventional','Proffetion'),(204,'Податковий інспектор','Conventional','Proffetion'),(205,'Ревізор, аудитор  (перевіряє фінансову діяльність  організацій)','Conventional','Proffetion'),(206,'Контролер-кредитор','Conventional','Proffetion'),(207,'Оператор ПК','Conventional','Proffetion'),(208,'Судовий виконавець','Conventional','Proffetion'),(209,'Архіваріус','Conventional','Proffetion'),(210,'Бухгалтер','Conventional','Proffetion'),(211,'Нотаріус','Conventional','Proffetion'),(212,'Бібліотекар','Conventional','Proffetion');
/*!40000 ALTER TABLE `HollandQuestion` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `HollandResult`
--

DROP TABLE IF EXISTS `HollandResult`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `HollandResult` (
  `HollandResultId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Score` int(11) DEFAULT NULL,
  `Type` varchar(50) DEFAULT NULL,
  `TestResultsId` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`HollandResultId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `HollandResult`
--

LOCK TABLES `HollandResult` WRITE;
/*!40000 ALTER TABLE `HollandResult` DISABLE KEYS */;
/*!40000 ALTER TABLE `HollandResult` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `IMQuestion`
--

DROP TABLE IF EXISTS `IMQuestion`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `IMQuestion` (
  `IMQuestionId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Question` varchar(250) NOT NULL,
  `CategoryId` bigint(20) NOT NULL,
  PRIMARY KEY (`IMQuestionId`)
) ENGINE=InnoDB AUTO_INCREMENT=175 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `IMQuestion`
--

LOCK TABLES `IMQuestion` WRITE;
/*!40000 ALTER TABLE `IMQuestion` DISABLE KEYS */;
INSERT INTO `IMQuestion` VALUES (1,'Знайомитись з життям рослин чи тварин?',1),(2,'Уроки географії, читання підручника з географії?',2),(3,'Читати художню або науково-популярну літературу про геологічні експедиції?',3),(4,'Уроки і читання підручника з анатомії та фізіології людини?',4),(5,'Уроки домоводства чи домашні заняття з домоводства?',5),(6,'Читати науково-популярну літературу про фізичні відкриття, про життя та діяльність видатних фізиків?',6),(7,'Читати про відкриття в хімії чи про життя і діяльність видатних хіміків?',7),(8,'Читати технічні журнали?',8),(9,'Читати статті у науково-популярних журналах про досягнення в галузі електротехніки та радіоелектроніки?',9),(10,'Знайомитися із різними металами та їх властивостями?',10),(11,'Дізнаватися про різні породи деревини та про практичне їх застосування?',11),(12,'Дізнаватися про досягнення в галузі будівництва?',12),(13,'Читати книги, дивитися фільми про водіїв різного виду транспорту?',13),(14,'Читати книги, дивитися фільми про льотчиків, космонавтів?',14),(15,'Знайомитися із воєнною технікою, зустрічатися з учасниками бойових дій?',15),(16,'Читати книги про історичні події та історичних діячів?',16),(17,'Читати твори класиків української та зарубіжної літератури?',17),(18,'Читати та обговорювати газетні, журнальні статті та. нариси?',18),(19,'Обговорювати біжучі події, справи у школі та класі?',19),(20,'Читати книги про життя школи (про роботу вчителя, вихователя)?',20),(21,'Читати книги, дивитися фільми про роботу міліції?',21),(22,'Піклуватися про порядок у речах, про гарний вигляд приміщення, у якому навчається, живе, працює?',22),(23,'Читати такі книги, як \"Цікава математика\" чи \"Математичне дозвілля\"?',23),(24,'Вивчати економічну географію? Вивчати іноземну мову?',24),(25,'Вивчати іноземну мову?',25),(26,'Знайомитися із життям видатних художників, із історією розвитку образотворчого мистецтва?',26),(27,'Знайомитися із життям видатних майстрів сцени і кіно, зустрічатися з артистами, колекціонувати їхні фотографії?',27),(28,'Знайомитися із життям і творчістю видатних музикантів, з питаннями теорії музичного мистецтва?',28),(29,' Читати спортивні газети, журнали, книги про спорт і видатних спортсменів?',29),(30,' Вивчати ботанику, зоологію, біологію?',1),(31,' Знайомитися із різними країнами за описами та географічними картами?',2),(32,' Читати про життя і діяльність відомих геологів?',3),(33,' Читати по те, як люди навчались боротися із хворобами, про лікарів та досягнення в галузі медицини?',4),(34,'Відвідувати з екскурсією підприємства легкої промисловості (швейне, взуттєве, текстильне та ін.)?',5),(35,'Читати книги типу \"Цікава фізика\", \"Фізики жартують\"?',6),(36,'Знаходити хімічні явища у природі, проводити досліди з хімії,слідкувати за перебігом хімічних явищ?',7),(37,'Знайомитися з найновішими досягненнями сучасної техніки?',8),(38,'Відвідувати радіотехнічний гурток чи знайомитися з роботою електрика?',9),(39,' Знайомитися з різними вимірювальними інструментами для металообробки і працювати з ними?',10),(40,'Спостерігати за виготовленням виробів із дерева, розглядати нові зразки меблів?',11),(41,' Зустрічатися з будівельниками, спостерігати за їх роботою?',12),(42,' Читати популярну літературу про засоби та правила пересування?',13),(43,'Читати книги, дивитися фільми про річників, моряків?',14),(44,'Читати книги, дивитися фільми на воєнні теми, знайомитись із історією війн, великих битв і долями видатних полководців?',15),(45,'Обговорювати біжучі політичні події у нас і за рубежем?',16),(46,'Читати літературно-критичні статті?',17),(47,'Слухати радіо- й теленовини, дивитись тематичні телепередачі?',18),(48,'Дізнаватися про події, які відбуваються в селі, місті, області, державі?',19),(49,'Давати пояснення товаришам, як виконувати навчальне завдання, коли вони не розуміють чогось?',20),(50,'Справедливо оцінити вчинок друга, знайомого чи літературного героя?',21),(51,'Забезпечувати сім\'ю продуктами, організовувати харчування всіх під час походу?',22),(52,'Читати науково-популярну літературу про відкриття в математиці, про життя та діяльність видатних математиків?',23),(53,'Цікавитися у пресі, на радіо і телебаченні про хід виконання економічних реформ?',24),(54,'Читати художню літературу іноземною мовою?',25),(55,'Бути членом редколегії, займатися художнім оформленням газет?',26),(56,'Відвідувати драматичний театр або театр юного глядача?',27),(57,'Слухати оперу та симфонічну музику?',28),(58,'Відвідувати спортивні змагання, слухати радіо і дивитися телепередачі?',29),(59,'Відвідувати біологічний гурток?',1),(60,'Займатися в географічному гуртку, вивчати природу і життя рідного краю?',2),(61,'Складати і збирати описи, зображення геологічних об\'єктів (мінералів, шарів землі тощо)?',3),(62,'Вивчати функції організму людини, причини виникнення хвороб і шляхи їх лікування?',4),(63,'Відвідувати гурток кулінарії, готувати вдома обіди?',5),(64,'Проводити досліди з фізики?',6),(65,'Готувати розчини, зважувати реактиви?',7),(66,'Розбирати, ремонтувати, збирати різні механізми (годинник, праску,велосипед, швейну машину та інше)?',8),(67,'Користуватися точними вимірювальними приладами (вольтметром,амперметром, ін.) і виконувати розрахунки?',9),(68,'Майструвати різні деталі і предмети з металу?',10),(69,'Збирати різні зразки деревини чи художньо обробляти дерево (випилювати, випалювати, вирізати, полірувати і ін.)?',11),(70,'Накидати будівельний ескіз чи виконувати креслення різних будівель?',12),(71,'Відвідувати гурток юних залізничників, юних автолюбителів?',13),(72,'Брати участь у секції парашутистів, у гуртку авіамоделістів чи у роботі авіаклубу?',14),(73,'Займатися у стрілковій секції?',15),(74,'Вивчати історію виникнення різних народів і держав?',16),(75,'Писати класні чи домашні твори з літератури?',17),(76,'Спостерігати за вчинками, поведінкою, життям інших людей, аналізувати життєві явища і події?',18),(77,'Виконувати громадську роботу (організовувати, згуртовувати товаришів на певну справу)?',19),(78,' Проводити час з маленькими дітьми (читати їм книги, що-небудь їм розповідати, допомагати їм у чомусь)?',20),(79,'Встановлювати дисципліну серед ровесників чи молодших?',21),(80,'Спостерігати за роботою продавця, повара, офіціанта?',22),(81,'Займатися у математичному гуртку?',23),(82,'Вивчати питання розвитку промисловості та бізнесу, дізнаватись про нові досягнення в галузі економіки?',24),(83,'Працювати із іншомовними словниками, розбиратися у мовних зворотах маловідомої мови?',25),(84,'Відвідувати музеї, художні виставки?',26),(85,'Виступати на сцені перед глядачами?',27),(86,'Грати на одному з музичних інструментів?',28),(87,'Грати у спортивні ігри?',29),(88,'Спостерігати за ростом і розвитком тварин і рослин, вести записи спостережень?',1),(89,'Самостійно складати географічні карти, збирати різні географічні матеріали?',2),(90,'Збирати колекції мінералів, експонати для географічного музею?',3),(91,'Займатись з роботою медсестри, лікаря чи фармацевта?',4),(92,'Відвідувати гурток крою та шиття, шити собі і членам сім\'ї?',5),(93,'Займатися у фізичному гуртку або відвідувати факультативні заняття з фізики?',6),(94,'Займатися у хімічному гуртку або відвідувати факультативні заняття з хімії?',7),(95,'Займатися у одному з технічних гуртків (моделювати літаки, пароплави, машини і т.н.)?',8),(96,'Займатися із влаштуванням електроприладів, електроапаратури й електричних машин, збирати, ремонтувати радіоприлади (підсилювачі, осцилографи та ін.), радіоапаратуру (приймачі, програвачі) та телеапаратуру (телевізори, відеомагнітофони тощо)?',9),(97,'Уроки праці в шкільних майстернях?',10),(98,'Брати участь у гуртку \"Умілі руки\" або в столярному?',11),(99,'Бувати на будівництві, спостерігати за ходом будівництва, за оздоблювальними роботами?',12),(100,'Контролювати дотримання правил руху пішоходами та водіями транспортних засобів?',13),(101,'Брати участь у секції веслярів, вітрильників, аквалангістів, серфінгу або в загоні рятівників потопаючих?',14),(102,'Брати участь у воєнізованих іграх?',15),(103,'Відвідувати історичні музеї, знайомитись з пам\'ятками культури народу?',16),(104,'Займатися в літературному гуртку, відвідувати факультативні заняття з мови чи літератури?',17),(105,'Вести особистий щоденник?',18),(106,'Виступати в класі з повідомленнями про міжнародне становище, з бесідами чи доповідями на різні теми?',19),(107,'Виконувати роботу організатора дитячих справ?',20),(108,'Встановлювати причини поведінки і вчинків людей, які вони хотіли б приховати?',21),(109,'Допомагати покупцеві у магазині вибирати покупку?',22),(110,'Розв\'язувати складні задачі з математики?',23),(111,'Точно вести підрахунки своїх грошових витрат і доходів?',24),(112,'Займатися вивченням іноземних мов у гуртку чи факультативі?',25),(113,'Займатися в художньому гуртку?',26),(114,'Брати участь в огляді художньої самодіяльності?',27),(115,'Займатися в хорі або в одному з музичних гуртків?',28),(116,'Займатися в певній спортивній секції?',29),(117,'Брати участь в біологічних олімпіадах або готувати виставки рослин чи тварин?',1),(118,'Брати участь у географічних експедиціях?',2),(119,'Брати участь у геологічній експедиції?',3),(120,'Спостерігати і доглядали хворих, надавати їм допомогу, полегшувати їх стан?',4),(121,'Брати участь у виставках (ярмарках) кулінарних або кондитерських виробів (чи відвідувати їх)?',5),(122,'Брати участь у фізичних олімпіадах?',6),(123,'Розв\'язувати складні задачі з хімії? Брати участь у хімічних олімпіадах?',7),(124,'Розбиратися у технічних кресленнях і схемах, креслити або складати малюнки?',8),(125,'Розбиратися у складних радіосхемах?',9),(126,'Відвідувати з екскурсією промислові підприємства, знайомитися з новими типами верстатів, спостерігати за їх роботою чи ремонтом?',10),(127,'Майструвати що-небудь із дерева своїми руками?',11),(128,'Брати посильну участь у будівельних роботах?',12),(129,'Брати посильну участь в обслуговуванні та ремонті автомобіля?',13),(130,'Управляти літаками громадянської авіації?',14),(131,'Жити за жорстко встановленим режимом, строго дотримуючись щоденного розпорядку?',15),(132,'Займатися в історичному гуртку (збирати матеріали, працювати в архіві, виступати з доповідями на історичні теми)?',16),(133,'Працювати з літературними джерелами, бібліографічними довідниками, вести щоденник вражень про прочитане?',17),(134,'Брати участь у диспутах і читацьких конференціях?',18),(135,'Готувати і проводити вечори відпочинку чи дискотеки?',19),(136,'Брати шефство над важковиховуваними, обговорювати з ким-небудь питання виховання дітей та підлітків?',20),(137,'Допомагати в роботі міліції?',21),(138,'Постійно спілкуватися з багатьма різними людьми?',22),(139,'Брати участь у математичних олімпіадах?',23),(140,'Цікавитися вартістю товарів, намагатися зрозуміти питання ціноутворення, зарплати, організації праці?',24),(141,'Розмовляти із знайомими іноземною мовою?',25),(142,'Брати участь у виставках образотворчого мистецтва?',26),(143,'Відвідувати театральний гурток?',27),(144,'Брати участь у музичних оглядах, конкурсах?',28),(145,'Брати участь у спортивних змаганнях?',29),(146,'Вирощувати в саду, на городі рослини чи виховувати тварин і доглядати їх?',1),(147,'Проводити топографічну зйомку місцевості?',2),(148,'Здійснювати тривалі й важкі походи, під час яких доводиться напружено працювати за заданою програмою?',3),(149,'Працювати в лікарні, поліклініці, аптеці?',4),(150,'Працювати спеціалістом на підприємстві легкої чи харчової промисловості?',5),(151,'Розв\'язувати складні задачі з фізики',6),(152,'Працювати на хімічному виробництві або в хімлабораторії?',7),(153,'Брати участь у виставках технічної творчості?',8),(154,'Працювати в галузі електроенергетики чи радіотехніки?',9),(155,'Працювати біля верстата (в основному стоячи), виготовляти різні металеві деталі до виробів?',10),(156,'Виконувати за кресленням столярні чи модельні роботи?',11),(157,'Працювати у будівельній бригаді?',12),(158,'Возити пасажирів або вантажі, дотримуватися правил вуличного руху?',13),(159,'Працювати в штормову погоду на великій річці або у відкритому морі?',14),(160,'Працювати воєнним спеціалістом?',15),(161,'Ходити в походи історичними місцями рідного краю?',16),(162,'Писати оповідання, складати вірші, байки тощо?',17),(163,'Писати замітки чи нариси до стінгазети або в пресу?',18),(164,'Керувати бригадою під час трудового десанта?',19),(165,'Організовувати ігри і свята для дітей?',20),(166,'Працювати в юридичному закладі (в суді, адвокатурі, прокуратурі)?',21),(167,'Надавати людям різні послуги?',22),(168,'Виконувати роботу, яка вимагає постійного використання математичних знань?',23),(169,'Працювати в галузі економіки, планування або фінансування різних підприємств, банківської справи?',24),(170,'Брати участь в олімпіадах, конкурсах, конференціях іноземною мовою?',25),(171,'Організовувати виставки образотворчого мистецтва, вчити малювати?',26),(172,'Грати на сцені або зніматися в кіно чи телефільмах?',27),(173,'Працювати музикантом, музичним режисером, викладати музику?',28),(174,'Працювати викладачем фізкультури або тренером?',29);
/*!40000 ALTER TABLE `IMQuestion` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `IMResult`
--

DROP TABLE IF EXISTS `IMResult`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `IMResult` (
  `IMResultId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Result` int(11) DEFAULT NULL,
  `JobNameId` bigint(20) DEFAULT NULL,
  `TestResultsId` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`IMResultId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `IMResult`
--

LOCK TABLES `IMResult` WRITE;
/*!40000 ALTER TABLE `IMResult` DISABLE KEYS */;
/*!40000 ALTER TABLE `IMResult` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `JobName`
--

DROP TABLE IF EXISTS `JobName`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `JobName` (
  `JobNameId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Name` varchar(250) NOT NULL,
  PRIMARY KEY (`JobNameId`)
) ENGINE=InnoDB AUTO_INCREMENT=59 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `JobName`
--

LOCK TABLES `JobName` WRITE;
/*!40000 ALTER TABLE `JobName` DISABLE KEYS */;
INSERT INTO `JobName` VALUES (1,'Біологія'),(2,'Географія'),(3,'Геологія'),(4,'Медецина'),(5,'Легка і харчова промисловість'),(6,'Фізика'),(7,'Хімія'),(8,'Техніка'),(9,'Електрорадіотехніка'),(10,'Металообробка'),(11,'Деревообробка'),(12,'Будівнитцво'),(13,'Транспорт'),(14,'Авіація, морські спеціалісти'),(15,'Військові спеціалісти'),(16,'Історія'),(17,'Література'),(18,'Журналістика'),(19,'Громадська діяльність'),(20,'Пелагогіка'),(21,'Правоб юристпруденція'),(22,'Торгівля'),(23,'Математика'),(24,'Економіка'),(25,'Іноземні мови'),(26,'Образотворче мистецтво'),(27,'Сценічне мистецтво'),(28,'Музика'),(29,'Фізкультура, спорт'),(30,'Біологія'),(31,'Географія'),(32,'Геологія'),(33,'Медецина'),(34,'Легка і харчова промисловість'),(35,'Фізика'),(36,'Хімія'),(37,'Техніка'),(38,'Електрорадіотехніка'),(39,'Металообробка'),(40,'Деревообробка'),(41,'Будівнитцво'),(42,'Транспорт'),(43,'Авіація, морські спеціалісти'),(44,'Військові спеціалісти'),(45,'Історія'),(46,'Література'),(47,'Журналістика'),(48,'Громадська діяльність'),(49,'Пелагогіка'),(50,'Правоб юристпруденція'),(51,'Торгівля'),(52,'Математика'),(53,'Економіка'),(54,'Іноземні мови'),(55,'Образотворче мистецтво'),(56,'Сценічне мистецтво'),(57,'Музика'),(58,'Фізкультура, спорт');
/*!40000 ALTER TABLE `JobName` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `LidershipQuestion`
--

DROP TABLE IF EXISTS `LidershipQuestion`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `LidershipQuestion` (
  `LidershipQuestionId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Question` varchar(250) NOT NULL,
  `KeyCase` int(11) DEFAULT NULL,
  `CaseA` varchar(100) DEFAULT NULL,
  `CaseB` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`LidershipQuestionId`)
) ENGINE=InnoDB AUTO_INCREMENT=49 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `LidershipQuestion`
--

LOCK TABLES `LidershipQuestion` WRITE;
/*!40000 ALTER TABLE `LidershipQuestion` DISABLE KEYS */;
INSERT INTO `LidershipQuestion` VALUES (1,'Чи часто ви перебуваєте у центрі уваги навколишніх?',1,'Так','Ні'),(2,'Чи вважаєте ви, що багато хто з оточуючих вас людей мають більш високе становище серед оточуючих?',1,'Так','Ні'),(3,'Перебуваючи у компанії людей, чи відчуваєте ви бажання не висловлювати своєї думки, навіть, коли це необхідно?',2,'Так','Ні'),(4,'Чи подобається вам бути лідером серед однолітків?',1,'Так','Ні'),(5,'Чи відчуваєте ви задоволення, коли вам вдається переконати когось у чомусь?',1,'Так','Ні'),(6,'Чи трапляється так, що вас називають нерішучою людиною?',2,'Так','Ні'),(7,'Чи згодні ви з твердженням: «Усе найкорисніше у світі є результатом діяльності невеликої кількості видатних людей»?',1,'Так','Ні'),(8,'Чи відчуваєте ви нагальну потребу в пораднику, який міг би спрямувати вашу діяльність?',2,'Так','Ні'),(9,'Чи отримуєте ви задоволення від того, що оточуючі побоюються вас?',2,'Так','Ні'),(10,'Чи намагаєтесь ви займати за столом (у компанії, зборах тощо) таке місце, що дозволяло б вам бути у центрі уваги і контролювати ситуацію? ',1,'Так','Ні'),(11,'Чи вважаєте ви, що викликаєте у людей враження значущості (імпозантності)?',1,'Так','Ні'),(12,'Чи вважаєте ви себе мрійником?',1,'Так','Ні'),(13,'Чи губитеся ви, якщо люди, що оточують вас, виражають незгоду з вами?',2,'Так','Ні'),(14,'Чи траплялося вам з особистої ініціативи займатися організацією трудових, спортивних та інших команд і колективів?',2,'Так','Ні'),(15,'Якщо те, що ви запланували, не дало очікуваних результатів, тоді ви:',1,'будете раді, якщо відповідальність за цю справу покладуть  на кого-небудь іншого;','візьмете на себе відповідальність, самі доведете справу до кінця;'),(16,'Яка з двох думок вам ближче?',2,'справжній  керівник повинен сам робити ту справу, якою він керує й особисто брати  участь у ній;','справжній  керівник повинен тільки вміти керувати іншими і не обов’язково робити справу сам?'),(17,'Уявіть, що ви керівник. З ким ви прагнете працювати?',1,'з покірними  людьми;','з незалежними  самостійними людьми;'),(18,'Чи намагаєтесь ви уникати гострих дискусій?',2,'Так','Ні'),(19,'Чи часто ви зіштовхувалися з владністю вашого батька?',2,'Так','Ні'),(20,'Чи вмієте ви у дискусії на тему, яку ви добре знаєте, залучити на свою сторону тих, хто раніше був з вами не згодний?',1,'Так','Ні'),(21,'Уявіть собі таку ситуацію: під час прогулянки з друзями у лісі ви загубилися. Вечір, потрібно приймати рішення. Які ваші дії?',1,'надасте  ухвалити рішення компетентному  з вас;','просто не будете нічого робити, розраховуючи на інших;'),(22,'Є таке прислів’я: «Краще бути першим у селі, ніж останнім у місті». Чи вірне воно?',1,'Так','Ні'),(23,'Чи вважаєте ви себе людиною, що має вплив на інших?',1,'Так','Ні'),(24,'Чи може невдача у прояві ініціативи змусити вас більше ніколи цього не робити?',2,'Так','Ні'),(25,'Хто, на ваш погляд, справжній лідер?',1,'найбільш компетентний чоловік;','той, у  кого найсильніший характер?'),(26,'Чи завжди ви намагаєтесь зрозуміти і вірно оцінити людей?',2,'Так','Ні'),(27,'Чи поважаєте ви дисципліну?',1,'Так','Ні'),(28,'Якому з наступних двох керівників ви віддасте перевагу?',2,'тому, хто  все вирішує сам;','тому, хто завжди радиться і прислухається до думок інших;'),(29,' Який з наступних стилів керівництва, на вашу думку, найкращий для роботи з колективом?',2,'колегіальний','авторитарний'),(30,'Чи часто у вас виникає враження, що інші зловживають вами?',1,'Так','Ні'),(31,'Який з наступних портретів більше нагадує вас?',1,'людина у  якої сильний голос, виразні жести, за словом у кишеню не лізе','людина, яка  має спокійний, тихий голос, стримана, замислена'),(32,'Як ви поводитиметеся на зборах, у колективі, якщо вважаєте свою думку правильною, але інші з вами не згодні?',2,'промовчите','будете обстоювати свою думку'),(33,'Чи підкоряєте ви свої інтереси і поводження інших людей справі, якою займаєтесь?',1,'Так','Ні'),(34,'Чи виникає у вас почуття тривоги, якщо на вас покладено відповідальність за яку-небудь важливу справу?',2,'Так','Ні'),(35,'Чому б ви віддали перевагу?',1,'працювати  під керівництвом гарної людини','працювати  самостійно, без керівників'),(36,'Як ви ставитеся до твердження: «Для того, щоб сімейне життя було гарним, необхідно, щоб рішення в родині приймав один з подружжя?',2,'згодний','не згодний'),(37,'Чи траплялось вам купувати що-небудь під впливом думки інших людей, а не виходячи з власної потреби?',1,'Так','Ні'),(38,'Чи вважаєте ви свої організаторські здібності гарними?',1,'Так','Ні'),(39,'Як поводитесь, зіштовхнувшись з труднощами?',1,'Так','Ні'),(40,'Чи дорікаєте ви людям, якщо вони на це заслуговують?',1,'Так','Ні'),(41,'Чи вважаєте ви, що ваша нервова система здатна витримати життєве навантаження?',1,'Так','Ні'),(42,'Уявіть, що ви керівник великої компанії. Як ви вчините, якщо вам запропонують реорганізувати вашу установу або організацію?',1,'запроваджу потрібні зміни негайно','не буду квапитися  і спочатку все ретельно обміркую'),(43,'Чи зумієте ви перервати занадто балакучого співрозмовника, якщо це необхідно?',1,'Так','Ні'),(44,'Чи вважаєте ви, що людина повинна зробити що-небудь видатне?',1,'Так','Ні'),(45,'Ким би ви прагнули стати?',1,'художником, поетом, композитором, ученим','видатним керівником, політичним діячем'),(46,'Яку музику вам приємніше слухати?',1,'гучну  і урочисту','тиху і  ліричну'),(47,'Чи відчуваєте ви хвилювання, очікуючи зустрічі з важливими і відомими людьми?',1,'Так','Ні'),(48,'Чи часто ви зустрічали людей з більш сильною волею, ніж ваша?',1,'Так','Ні');
/*!40000 ALTER TABLE `LidershipQuestion` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `LidershipResult`
--

DROP TABLE IF EXISTS `LidershipResult`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `LidershipResult` (
  `LidershipResultId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Score` int(11) DEFAULT NULL,
  `Message` varchar(250) DEFAULT NULL,
  PRIMARY KEY (`LidershipResultId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `LidershipResult`
--

LOCK TABLES `LidershipResult` WRITE;
/*!40000 ALTER TABLE `LidershipResult` DISABLE KEYS */;
/*!40000 ALTER TABLE `LidershipResult` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `MotivationQuestion`
--

DROP TABLE IF EXISTS `MotivationQuestion`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `MotivationQuestion` (
  `MotivationQuestionId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Question` varchar(250) NOT NULL,
  `MotivationVector` varchar(50) NOT NULL,
  PRIMARY KEY (`MotivationQuestionId`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `MotivationQuestion`
--

LOCK TABLES `MotivationQuestion` WRITE;
/*!40000 ALTER TABLE `MotivationQuestion` DISABLE KEYS */;
INSERT INTO `MotivationQuestion` VALUES (1,'Вимагає спілкування  з різними людьми','InternalIndividual'),(2,'Подобається батькам','ExternalNegative'),(3,'Передбачає високу відповідальність','InternalSocial'),(4,'Вимагає переїзду на нове місце проживання','ExternalPositive'),(5,'Відповідає моїм здібностям','InternalIndividual'),(6,'Дозволяє обмежитися наявним устаткуванням','ExternalNegative'),(7,'Дає можливість приносити користь людям','InternalSocial'),(8,'Сприяє розумовому і фізичному розвитку','InternalIndividual'),(9,'Високооплачувана  професія','ExternalPositive'),(10,'Дозволяє працювати  близько від будинку','ExternalPositive'),(11,'Престижна професія','ExternalNegative'),(12,'Дає можливості для зростання професійної майстерності','InternalSocial'),(13,'Єдино можлива  в обставинах, що склалися','ExternalNegative'),(14,'Дозволяє реалізувати  здібності до керівної роботи','ExternalPositive'),(15,'Приваблива','InternalIndividual'),(16,'Близька до улюбленого шкільного предмету','ExternalPositive'),(17,'Дозволяє відразу  отримати добрий результат праці  для інших','InternalSocial'),(18,'Вибрана моїми  друзями','ExternalNegative'),(19,'Дозволяє використовувати  професійні уміння поза роботою','ExternalPositive'),(20,'Дає великі можливості проявити творчість','InternalIndividual');
/*!40000 ALTER TABLE `MotivationQuestion` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `MotivationResult`
--

DROP TABLE IF EXISTS `MotivationResult`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `MotivationResult` (
  `MotivationResultId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Speciality` varchar(200) DEFAULT NULL,
  `TestResultsId` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`MotivationResultId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `MotivationResult`
--

LOCK TABLES `MotivationResult` WRITE;
/*!40000 ALTER TABLE `MotivationResult` DISABLE KEYS */;
/*!40000 ALTER TABLE `MotivationResult` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Role`
--

DROP TABLE IF EXISTS `Role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `Role` (
  `RoleId` smallint(6) NOT NULL AUTO_INCREMENT,
  `Authority` varchar(50) NOT NULL,
  `Name` varchar(50) NOT NULL,
  PRIMARY KEY (`RoleId`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Role`
--

LOCK TABLES `Role` WRITE;
/*!40000 ALTER TABLE `Role` DISABLE KEYS */;
INSERT INTO `Role` VALUES (1,'ROLE_ADMINISTRATOR','Administrator'),(2,'ROLE_STUDENT','Student');
/*!40000 ALTER TABLE `Role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `School`
--

DROP TABLE IF EXISTS `School`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `School` (
  `SchoolId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Name` varchar(50) NOT NULL,
  PRIMARY KEY (`SchoolId`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `School`
--

LOCK TABLES `School` WRITE;
/*!40000 ALTER TABLE `School` DISABLE KEYS */;
INSERT INTO `School` VALUES (1,'СЗШ1'),(2,'СЗШ2'),(3,'СЗШ3'),(4,'СЗШ4'),(5,'СЗШ5'),(6,'СЗШ6'),(7,'СЗШ7'),(8,'СЗШ8'),(9,'СЗШ9');
/*!40000 ALTER TABLE `School` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `SphereResult`
--

DROP TABLE IF EXISTS `SphereResult`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `SphereResult` (
  `SphereResultId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Score` int(11) DEFAULT NULL,
  `SphereId` varchar(50) DEFAULT NULL,
  `YovayshyResultId` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`SphereResultId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `SphereResult`
--

LOCK TABLES `SphereResult` WRITE;
/*!40000 ALTER TABLE `SphereResult` DISABLE KEYS */;
/*!40000 ALTER TABLE `SphereResult` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `TestResults`
--

DROP TABLE IF EXISTS `TestResults`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `TestResults` (
  `TestResultsId` bigint(20) NOT NULL AUTO_INCREMENT,
  `StudentName` varchar(250) DEFAULT NULL,
  `SchoolId` bigint(20) DEFAULT NULL,
  `ActualityResults` int(11) DEFAULT NULL,
  `YovayshyResultId` bigint(20) DEFAULT NULL,
  `DateCreated` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `LidershipResultId` bigint(20) DEFAULT NULL,
  `MotivationResultId` bigint(20) DEFAULT NULL,
  PRIMARY KEY (`TestResultsId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `TestResults`
--

LOCK TABLES `TestResults` WRITE;
/*!40000 ALTER TABLE `TestResults` DISABLE KEYS */;
/*!40000 ALTER TABLE `TestResults` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `User`
--

DROP TABLE IF EXISTS `User`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `User` (
  `UserId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Username` varchar(250) NOT NULL,
  `FirstName` varchar(250) DEFAULT NULL,
  `LastName` varchar(250) DEFAULT NULL,
  `Password` varchar(250) NOT NULL,
  `Enabled` bit(1) NOT NULL,
  `AccountExpired` bit(1) NOT NULL,
  `AccountLocked` bit(1) NOT NULL,
  `PasswordExpired` bit(1) NOT NULL,
  PRIMARY KEY (`UserId`),
  UNIQUE KEY `UQ_Username` (`Username`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `User`
--

LOCK TABLES `User` WRITE;
/*!40000 ALTER TABLE `User` DISABLE KEYS */;
INSERT INTO `User` VALUES (1,'admin','Admin','Istrator','8c6976e5b5410415bde908bd4dee15dfb167a9c873fc4bb8a81f6f2ab448a918','','\0','\0','\0'),(2,'student','John','Smith','JAvlGPq9JyTdtvBO6x2llnRI1+gxwIyPqCKAn3THIKk=','','\0','\0','\0');
/*!40000 ALTER TABLE `User` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `UserRole`
--

DROP TABLE IF EXISTS `UserRole`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `UserRole` (
  `UserId` bigint(20) NOT NULL,
  `RoleId` smallint(6) NOT NULL,
  PRIMARY KEY (`UserId`,`RoleId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `UserRole`
--

LOCK TABLES `UserRole` WRITE;
/*!40000 ALTER TABLE `UserRole` DISABLE KEYS */;
INSERT INTO `UserRole` VALUES (1,1),(2,2);
/*!40000 ALTER TABLE `UserRole` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `VectorResult`
--

DROP TABLE IF EXISTS `VectorResult`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `VectorResult` (
  `VectorResultId` bigint(20) NOT NULL AUTO_INCREMENT,
  `MotivationVector` varchar(30) DEFAULT NULL,
  `Score` int(11) DEFAULT NULL,
  `MotivationResultId` bigint(20) NOT NULL,
  PRIMARY KEY (`VectorResultId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `VectorResult`
--

LOCK TABLES `VectorResult` WRITE;
/*!40000 ALTER TABLE `VectorResult` DISABLE KEYS */;
/*!40000 ALTER TABLE `VectorResult` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `YovayshyQuestion`
--

DROP TABLE IF EXISTS `YovayshyQuestion`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `YovayshyQuestion` (
  `YovayshyQuestionId` bigint(20) NOT NULL AUTO_INCREMENT,
  `Question` varchar(250) NOT NULL,
  `CaseA` varchar(250) NOT NULL,
  `CaseB` varchar(250) NOT NULL,
  `KeyOnA` varchar(50) NOT NULL,
  `KeyOnB` varchar(50) NOT NULL,
  PRIMARY KEY (`YovayshyQuestionId`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `YovayshyQuestion`
--

LOCK TABLES `YovayshyQuestion` WRITE;
/*!40000 ALTER TABLE `YovayshyQuestion` DISABLE KEYS */;
INSERT INTO `YovayshyQuestion` VALUES (1,'Уявіть, що  ви на виставці. Що вас більше  привабить в експонатах','колір, досконалість форм','як і з чого вони зроблені','Art','Technical'),(2,'Які риси  в людині вам більше подобаються','дружелюбність, чуйність, безкорисливість;','мужність, сміливість, витривалість.','Poepleware','Handwork'),(3,'Побутові послуги надають людям різні послуги. Чи вважаєте за необхідне','надалі розвивати цю галузь, аби всесторонньо обслуговувати людей','створювати таку техніку, якою можна було б самим користуватися в побуті','Material','Technical'),(4,'Яка з нагород Вас більше порадує','за суспільно-корисну діяльність','за науковий винахід','Poepleware','Intelligence'),(5,'Ви дивитеся  військовий або спортивний парад.  Що більше привабить вашу увагу','злагодженість ходьби, граціозність учасників параду','зовнішнє оформлення колон (прапори, одяг і ін.)','Handwork','Art'),(6,'Уявіть, що  у вас багато вільного часу. Чим би ви більш охоче зайнялись','чим-небудь практичним (ручною працею)','суспільною роботою (на добровільних засадах)','Technical','Poepleware'),(7,'Яку виставку  ви б з великим задоволенням  переглянули','новинок наукової техніки (в області фізики, хімії, біології)','нових продовольчих товарів','Intelligence','Material'),(8,'Якби в школі були два гуртки, який би ви вибрали','музичний','технічний','Art','Technical'),(9,'Якби ви були на посаді директора школи, на що б ви звернули більше уваги','на згуртованість колективу','на створення необхідних зручностей','Poepleware','Technical'),(10,'Які журнали  ви б з великим задоволенням  читали','літературно-художні','науково-популярні','Art','Intelligence'),(11,'Що важливіше  для людини','створювати собі зручний побут','жити без деяких зручностей, але мати можливість користуватися скарбницею мистецтва, створювати мистецтво','Handwork','Art'),(12,'Для благополуччя суспільства необхідно','техніка','правосуддя','Technical','Poepleware'),(13,'Яку з двох книг ви б з більшим задоволенням читали','про розвиток науки в нашій країні','про досягнення спортсменів нашої країни','Intelligence','Handwork'),(14,'У газеті  дві статті різного змісту. Яка викличе у Вас більшу зацікавленість','про новітню машину','про нову наукову теорію','Technical','Intelligence'),(15,'Яка з двох  робіт на свіжому повітрі Вас  більше б приваблює','робота, пов\'язана з постійними рухом (агроном, лісничий, дорожній майстер)','робота з машинами','Handwork','Technical'),(16,'Яке, на ваш погляд, завдання школи важливіше','підготувати дітей до роботи з людьми, аби вони могли допомагати іншим створювати матеріальні блага','підготувати дітей до практичної діяльності, до уміння створювати матеріальні блага','Poepleware','Handwork'),(17,'Що, на ваш  погляд, слід більше цінувати  у учасників самодіяльності','те, що вони несуть людям мистецтво і красу','те, що вони виконують суспільно корисну роботу','Art','Poepleware'),(18,'Яка, на  ваш погляд, область діяльності  людини надалі матиме домінуюче  значення','фізика','фізична культура','Intelligence','Handwork'),(19,'Що суспільству  принесе більше користі','турбота про добробут громадян','вивчення поведінки людей','Handwork','Poepleware'),(20,'Якого характеру  наукову роботу ви б вибрали','роботу з книгами в бібліотеці','роботу на свіжому повітрі в експедиції','Intelligence','Handwork'),(21,'Уявіть, що  ви професор університету. Чому  ви віддали б перевагу у  вільний від роботи час','заняттям по літературі','дослідам по фізиці, хімії','Art','Intelligence'),(22,'Вам надається  можливість зробити подорож в  різні країни. Куди б ви більш охоче поїхали','як відомий спортсмен на міжнародні змагання','як відомий фахівець зовнішньої торгівлі з метою покупки необхідних товарів для нашої країни','Handwork','Material'),(23,'Які лекції  ви б слухали з великим задоволенням','про видатних художників','про видатних учених','Art','Poepleware'),(24,'Що вас більше  приваблює при читанні книг','яскраве зображення сміливості і хоробрості героїв','прекрасний літературний стиль','Handwork','Art'),(25,'Вам надається  можливість вибору професії. Який з них ви б віддали перевагу','роботі малорухливої, але пов\'язаної із створенням нової техніки','фізичній культурі або іншій роботі, пов\'язаній з рухом','Technical','Handwork'),(26,'Якими видатними  ученими ви більше цікавитеся','Поповим і Ціолковським','Менделєєвим і Павловим','Technical','Intelligence'),(27,'Як вам здається, на що слід було б в школі  звернути більше уваги','на спорт, оскільки це потрібно для зміцнення здоров\'я','на успішність учнів, оскільки це необхідно для їх майбутнього','Handwork','Material'),(28,'Що б вас  більше зацікавило в ЗМІ','повідомлення про художню виставку, що відбулася','звістка про минулий мітинг в захист прав людини','Art','Poepleware'),(29,'Якби вам  трапилася нагода зайняти певний  пост, який би ви вибрали','головного інженера заводу','директора супермаркету','Material','Technical'),(30,'Як ви вважаєте, що важливіше','багато знати','створювати матеріальні цінності','Intelligence','Material');
/*!40000 ALTER TABLE `YovayshyQuestion` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `YovayshyResult`
--

DROP TABLE IF EXISTS `YovayshyResult`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `YovayshyResult` (
  `YovayshyResultId` bigint(20) NOT NULL AUTO_INCREMENT,
  `ProffecionalSphere` varchar(200) DEFAULT NULL,
  `ProffecionalIntrests` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`YovayshyResultId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `YovayshyResult`
--

LOCK TABLES `YovayshyResult` WRITE;
/*!40000 ALTER TABLE `YovayshyResult` DISABLE KEYS */;
/*!40000 ALTER TABLE `YovayshyResult` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2011-09-04 12:29:54
