
create table ActualQuestion (
    ActualQuestionId bigint(20) not null auto_increment,
    Question varchar(250) not null,
    isReverted bit,

    primary key (ActualQuestionId)
) engine=InnoDB default charset=utf8;


INSERT INTO `ActualQuestion` VALUES
        (1,'Я не соромлюся  жодної зі своїх емоцій','\0'),
        (2,'Я відчуваю, що мушу робити те, що очікують від мене інші',''),
        (3,'Я вірю, що люди самі по собі є добрими, тому їм можна довіряти','\0'),
        (4,'Я можу гніватися на тих, кого люблю','\0'),
        (5,'Завжди необхідно, щоб інші схвалювати те, що я роблю',''),
        (6,'Я не приймаю своїх слабких сторін',''),
        (7,'Мені можуть подобатися люди, вчинки яких я не схвалюю','\0'),
        (8,'Я боюся невдач',''),
        (9,'Я намагаюся не аналізувати і не спрощувати складні сторони життя',''),(10,'Краще бути самим собою, ніж популярним','\0'),(11,'В моєму житті нема чогось такого, чому я особливо хочу присвятити себе',''),(12,'Я можу виразити свої почуття, навіть якщо це призведе до небажаних наслідків','\0'),(13,'Я не зобов’язана/зобов’язаний допомагати іншим',''),(14,'Я стомилася/стомився  від страхів і неадекватності',''),(15,'Мене люблять, тому що люблю я','\0'),(16,'Я не соромлюся  жодної зі своїх емоцій','\0'),(17,'Я відчуваю, що мушу робити те, що очікують від мене інші',''),(18,'Я вірю, що люди самі по собі є добрими, тому їм можна довіряти','\0'),(19,'Я можу гніватися на тих, кого люблю','\0'),(20,'Завжди необхідно, щоб інші схвалювати те, що я роблю',''),(21,'Я не приймаю своїх слабких сторін',''),(22,'Мені можуть подобатися люди, вчинки яких я не схвалюю','\0'),(23,'Я боюся невдач',''),(24,'Я намагаюся не аналізувати і не спрощувати складні сторони життя',''),(25,'Краще бути самим собою, ніж популярним','\0'),(26,'В моєму житті нема чогось такого, чому я особливо хочу присвятити себе',''),(27,'Я можу виразити свої почуття, навіть якщо це призведе до небажаних наслідків','\0'),(28,'Я не зобов’язана/зобов’язаний допомагати іншим',''),(29,'Я стомилася/стомився  від страхів і неадекватності',''),(30,'Мене люблять, тому що люблю я','\0');